#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
module.state.aws_dynamodb_table.tf_lock_state: Refreshing state... [id=cloud-octo-lock]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0d8ae994ae9415dc1]
module.state.aws_s3_bucket.state_bucket: Refreshing state... [id=cloud-octo-tfstate]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-04fabcfefaa473d92]
module.vpc.aws_route_table.public-route-table: Refreshing state... [id=rtb-0787895f9f0635677]
module.vpc.aws_subnet.public-subnet-1: Refreshing state... [id=subnet-0a94aea76950ca02d]
module.vpc.aws_subnet.public-subnet-2: Refreshing state... [id=subnet-02d5b1534255dca45]
module.vpc.aws_subnet.private-subnet-2: Refreshing state... [id=subnet-0abc69c7d926f8ece]
module.vpc.aws_route_table.private-route-table: Refreshing state... [id=rtb-02b56f89e92dd305f]
module.vpc.aws_subnet.private-subnet-1: Refreshing state... [id=subnet-08a7c4feae46b5a19]
module.vpc.aws_eip.elastic-ip-for-nat-gw: Refreshing state... [id=eipalloc-04e14d7cb097a456a]
module.vpc.aws_route_table_association.private-route-2-association: Refreshing state... [id=rtbassoc-046e8beeef8e16844]
module.vpc.aws_route.public-internet-igw-route: Refreshing state... [id=r-rtb-0787895f9f06356771080289494]
module.vpc.aws_route_table_association.public-route-1-association: Refreshing state... [id=rtbassoc-02da7c0a674dddd8d]
module.vpc.aws_route_table_association.private-route-1-association: Refreshing state... [id=rtbassoc-0256479ded924fcdc]
module.vpc.aws_route_table_association.public-route-2-association: Refreshing state... [id=rtbassoc-0971fe15adcf8fe94]
module.vpc.aws_nat_gateway.nat-gw: Refreshing state... [id=nat-00ce33928a72b48cb]
module.vpc.aws_route.nat-gw-route: Refreshing state... [id=r-rtb-02b56f89e92dd305f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apigateway.aws_alb_listener.ecs-alb-http-listener will be created
  + resource "aws_alb_listener" "ecs-alb-http-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Environment" = "dev"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.apigateway.aws_alb_target_group.default will be created
  + resource "aws_alb_target_group" "default" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "apigateway-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "dev"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0d8ae994ae9415dc1"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 150
          + matcher             = "200-299"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 20
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.apigateway.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/apigateway/apigateway-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.apigateway.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "apigateway"
      + tags_all = {
          + "Environment" = "dev"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.apigateway.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "apigateway-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "dev"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "apigateway"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-08a7c4feae46b5a19",
              + "subnet-0abc69c7d926f8ece",
            ]
        }
    }

  # module.apigateway.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "gunicorn",
                      + "-w",
                      + "3",
                      + "-b",
                      + ":80",
                      + "apig.wsgi:application",
                    ]
                  + cpu              = 1
                  + environment      = []
                  + essential        = true
                  + image            = ":latest"
                  + links            = []
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/apigateway"
                          + awslogs-region        = "eu-west-2"
                          + awslogs-stream-prefix = "apigateway-log-stream"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = []
                  + name             = "apigateway"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "apigateway"
      + id                       = (known after apply)
      + memory                   = "256"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "dev"
        }
    }

  # module.apigateway.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-staging-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.apigateway.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "apigateway-ecsTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.apigateway.aws_iam_role_policy_attachment.ecs_task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-staging-execution-role"
    }

  # module.apigateway.aws_lb.lb will be created
  + resource "aws_lb" "lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "apigateway-alb"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-02d5b1534255dca45",
          + "subnet-0a94aea76950ca02d",
        ]
      + tags_all                   = {
          + "Environment" = "dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.apigateway.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Allows inbound access from ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-to-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev"
        }
      + vpc_id                 = "vpc-0d8ae994ae9415dc1"
    }

  # module.apigateway.aws_security_group.load-balancer will be created
  + resource "aws_security_group" "load-balancer" {
      + arn                    = (known after apply)
      + description            = "Controls access to ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ALB traffic to Internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Internet traffic to ALB"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Internet traffic to ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "internet-to-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev"
        }
      + vpc_id                 = "vpc-0d8ae994ae9415dc1"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @pazsaragi, Action: `pull_request`*